# Before you start:
- Read the SQLtoPythonViz.md file and use the resources
- Happy learning!

In [1]:
# Import numpy, pandas and mysqlalchemy (following what you have learned in previous lessons):
import numpy as np
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import getpass
p = getpass.getpass()

········

# Challenge 1 - Load and Evaluate the Datasets

#### In this challenge we will load data from MySQL Sakila database or Sian's Harry Potter MySQL database, by querying and evaluating the results returned using MySQL we can be selective about the data used to make visualisation with seaborn/matplotlib very easy

In the cell below, create a mysql engine for your local mysql instance and include your username, password and database schema name by creating a variable connection string following the following pattern:

create_engine(‘dialect+driver://username:password@host:port/database’)

This is the format to create the engine for a local mysql connection


connection_string = 'mysql+pymysql://root:' + password + '@localhost/db'


engine = create_engine(connection_string)

In [2]:
# Your code here:
connection_string = 'mysql+pymysql://root:' + p + '@localhost/sakila'

In [3]:
engine = create_engine(connection_string)

Use this connection to load data with a sql query which connects the target tables in your database using joins, selects the fields you wish to work with and any aggregation columns + grouping / window function new columns or filters by where/having as appropriate. You can draw on any of the labs or lessons to establish what your query should look like. Its ok if this stage is a little trial and error!

In [4]:
# Your code here:
df= pd.read_sql_query('select * from sakila.city c join address a on c.city_id = a.city_id join customer cu on a.address_id = cu.address_id join rental r on cu.customer_id = r.customer_id;', engine)

#### Let's start examining the dataset to ensure we have the data we want to visualise.

First look at the first five rows using the `head` function.

In [5]:
# Your code here:
df.head()

,city_id,city,country_id,last_update,address_id,address,address2,district,city_id,postal_code,...,active,create_date,last_update,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,463,Sasebo,50,2006-02-15 04:45:25,5,1913 Hanoi Way,,Nagasaki,463,35200,...,1,2006-02-14 22:04:36,2006-02-15 04:57:20,76,2005-05-25 11:30:37,3021,1,2005-06-03 12:00:37,2,2006-02-15 21:30:53
1,463,Sasebo,50,2006-02-15 04:45:25,5,1913 Hanoi Way,,Nagasaki,463,35200,...,1,2006-02-14 22:04:36,2006-02-15 04:57:20,573,2005-05-28 10:35:23,4020,1,2005-06-03 06:32:23,1,2006-02-15 21:30:53
2,463,Sasebo,50,2006-02-15 04:45:25,5,1913 Hanoi Way,,Nagasaki,463,35200,...,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1185,2005-06-15 00:54:12,2785,1,2005-06-23 02:42:12,2,2006-02-15 21:30:53
3,463,Sasebo,50,2006-02-15 04:45:25,5,1913 Hanoi Way,,Nagasaki,463,35200,...,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1422,2005-06-15 18:02:53,1021,1,2005-06-19 15:54:53,2,2006-02-15 21:30:53
4,463,Sasebo,50,2006-02-15 04:45:25,5,1913 Hanoi Way,,Nagasaki,463,35200,...,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1476,2005-06-15 21:08:46,1407,1,2005-06-25 02:26:46,1,2006-02-15 21:30:53

Next, lets use the `info` function to see the dtypes and row counts

In [7]:
# Your code here:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16044 entries, 0 to 16043
Data columns (total 29 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   city_id       16044 non-null  int64
 1   city          16044 non-null  object
 2   country_id    16044 non-null  int64
 3   last_update   16044 non-null  datetime64[ns]
 4   address_id    16044 non-null  int64
 5   address       16044 non-null  object
 6   address2      16044 non-null  object
 7   district      16044 non-null  object
 8   city_id       16044 non-null  int64
 9   postal_code   16044 non-null  object
 10  phone         16044 non-null  object
 11  location      16044 non-null  object
 12  last_update   16044 non-null  datetime64[ns]
 13  customer_id   16044 non-null  int64
 14  store_id      16044 non-null  int64
 15  first_name    16044 non-null  object
 16  last_name     16044 non-null  object
 17  email         16044 non-null  object
 18  address_id    16044 non-null  int64
 19  active        16044 non-null  int64
 20  create_date   16044 non-null  datetime64[ns]
 21  last_update   16044 non-null  datetime64[ns]
 22  rental_id     16044 non-null  int64
 23  rental_date   16044 non-null  datetime64[ns]
 24  inventory_id  16044 non-null  int64
 25  customer_id   16044 non-null  int64
 26  return_date   15861 non-null  datetime64[ns]
 27  staff_id      16044 non-null  int64
 28  last_update   16044 non-null  datetime64[ns]
dtypes: datetime64[ns](7), int64(12), object(10)
memory usage: 3.5+ MB

Next, we'll examine the `describe` function to see the descriptive statistics for the numeric variables.

In [8]:
# Your code here:
df.describe()

,city_id,country_id,address_id,city_id,customer_id,store_id,address_id,active,rental_id,inventory_id,customer_id,staff_id
count,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000,16044.000000
mean,300.512902,56.713538,301.862628,300.512902,297.147282,1.454749,301.862628,0.974882,8025.371478,2291.749252,297.147282,1.498816
std,173.349650,30.117795,173.080597,173.349650,172.448362,0.497964,173.080597,0.156490,4632.777249,1322.319482,172.448362,0.500014
min,1.000000,1.000000,5.000000,1.000000,1.000000,1.000000,5.000000,0.000000,1.000000,1.000000,1.000000,1.000000
25%,148.000000,29.000000,152.000000,148.000000,148.000000,1.000000,152.000000,1.000000,4013.750000,1154.000000,148.000000,1.000000
50%,303.000000,50.000000,301.000000,303.000000,296.000000,1.000000,301.000000,1.000000,8025.500000,2291.000000,296.000000,1.000000
75%,450.000000,80.000000,451.000000,450.000000,446.000000,2.000000,451.000000,1.000000,12037.250000,3433.000000,446.000000,2.000000
max,600.000000,109.000000,605.000000,600.000000,599.000000,2.000000,605.000000,1.000000,16049.000000,4581.000000,599.000000,2.000000

#### At this stage it may be necessary to load another set of data with an additional mysql query and repeat the stages above - perhaps you are thinking to join the results of your two queries together or you think that both should be visualised separately to answer the question you came up with?

Do this in the following 3 cells below.

In [15]:
# Your code here:
# We need the country name

df1= pd.read_sql_query('select * from sakila.country', engine)

In [16]:
df1.to_csv('country.csv', index=False)

In [17]:
# Your code here:

df2 = pd.read_sql_query('SELECT * from sakila.category c JOIN sakila.film_category fc ON c.category_id = fc.category_id JOIN sakila.film f ON fc.film_id = f.film_id JOIN sakila.inventory i ON f.film_id = i.film_id JOIN sakila.rental r ON i.inventory_id = r.inventory_id JOIN sakila.payment p ON r.rental_id = p.rental_id', engine)

In [18]:
df2.to_csv('film.csv', index=False)

In [ ]:
# Your code here:

#### Exploratory Data Analysis
You might benefit from doing some elementary EDA at this stage before jumping into plotting data, as this can help you grasp the shape, diversity and gaps in the data you have selected. This is a timesaver!

For this task you can use matplotlib/seaborn so you will need to import them, then work with : 

- df.hist()
- sns.boxplot(x=df["colname"])

In [ ]:
# Your code here (import visual libraries)

In [ ]:
# Your code here (histogram all numericals)

In [ ]:
# Your code here (box plot to see outliers for specific columns)

### Optional - if you are using more than one sql query 

If you decided to load two dataframes from two separate mysql queries and need to merge them using the merge concat or join functions, do so now. You can follow [this tutorial](https://realpython.com/pandas-merge-join-and-concat/) for more information about bringing dataframes together

In [ ]:
# your code here

# Challenge 2 - Export your data frame as a csv 

Export df to a csv file using the `df.to_csv` function, filtered if suitable, excluding any columns which are not useful for further analysis

In [ ]:
# Your code here:
df.to_csv('data.csv', index=False)

# Challenge 3: Visualise relationships found in the data

At this stage you can visualise the data in your chosen tool, Tableau, Excel, Python(matploitlib,seaborn)

**Business Question**: think about what are the question(s) you want to answer with the data you have gathered from the MySQL database. Make the question as specific as possible 
- for example, which eye colour is most common per Hogwarts house? 
- for example, are childrens films rented more frequently on weekends than comedies?

**Visuals**: Think about what plot type best supports answering your question(s). Each plot/ visualisation should have an appropriate title, legend and axis labels, so the meaning is as clear as possible without needing a caption. Make use of colour pallettes ! dont just create a blue plot :) 

**Bonus** - find a way to amend your visualisation to add in at least one other interesting data point you have identified in the data to enhance the plot.

In [ ]:
# (if plotting in python) Your code here:

The visualization is in Tableau.

1. Which country have the most rentals (Top 20)?
2. How looks the distribution of the category in the country with the most rentals?
3. What is the preferred category?
4. Which city has the highest rentals?
5. What city prefered mostly what category (by dropdown single filter)?